// 整数的2进制表示有3种
//原码
//反码
//补码

//正整数3个相同
//负整数的3个要计算

//7
//00000000 00000000 00000000 00000111 - 原码
//00000000 00000000 00000000 00000111 - 反码
//00000000 00000000 00000000 00000111 - 补码

//-7
//10000000 00000000 00000000 00000111 - 原码
//11111111 11111111 11111111 11111000 - 反码(原码的符号不变,其他位按位取反就是反码)
//11111111 11111111 11111111 11111001 - 补码(反码 + 1 就是补码)
//
//整数在内存中存储的是补码
//
// << 左移操作符
// 补码左移    左边抛弃右边补0

// >> 右移操作符

// 算数移位
// 补码右移    右边抛弃左边补原来的符号

// 逻辑移位
// 右边抛弃左边补0


//只能整数
// &    按位(二进制)与
// |    按位(二进制)或
// ^    按位(二进制)异或
// a ^ a = 0;
// 0 ^ a = a;
// 支持交换律

//  a = a ^ b;
//  b = a ^ b; //b = a ^ b ^ b = a
//  a = a ^ b; //a = a ^ a ^ b = b